---
kind: property
id: P:Autodesk.Revit.DB.Analysis.PathOfTravel.PathMidpoint
source: html/ab45a2d1-62d0-8823-0947-823f2d130e93.htm
---
# Autodesk.Revit.DB.Analysis.PathOfTravel.PathMidpoint Property

The midpoint of the path. The Z coordinate will equal the view's level elevation.

## Syntax (C#)
```csharp
public XYZ PathMidpoint { get; }
```